# XMLConfigFileName Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IFCFileWriteOptions..::..XMLConfigFileName Property
IFCFileWriteOptions Class See Also
---
The XML configuration file name. It is used only for writing IFC-XML format file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string XMLConfigFileName { get; set; }
```

Visual Basic
---
```text
Public Property XMLConfigFileName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ XMLConfigFileName {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
It uses default configuration if it is not set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace